export const regions = {
  "منطقة الرياض": [
    "الرياض",
    "الدرعية",
    "الخرج",
    "الدوادمي",
    "المجمعة",
    "القويعية",
    "الأفلاج",
    "وادي الدواسر",
    "الزلفي",
    "شقراء",
    "حوطة بني تميم",
    "عفيف",
  ],
  "منطقة مكة المكرمة": [
    "مكة المكرمة",
    "جدة",
    "الطائف",
    "القنفذة",
    "الليث",
    "رابغ",
    "خليص",
    "الخرمة",
    "رنية",
    "تربة",
  ],
  "منطقة المدينة المنورة": [
    "المدينة المنورة",
    "ينبع",
    "العلا",
    "المهد",
    "الحناكية",
    "بدر",
    "خيبر",
    "العيص",
  ],
  "منطقة القصيم": [
    "بريدة",
    "عنيزة",
    "الرس",
    "المذنب",
    "البكيرية",
    "البدائع",
    "الأسياح",
    "رياض الخبراء",
  ],
  "المنطقة الشرقية": [
    "الدمام",
    "الأحساء (الهفوف والمبرز)",
    "الخبر",
    "الظهران",
    "حفر الباطن",
    "القطيف",
    "الجبيل",
    "الخفجي",
  ],
  "منطقة عسير": [
    "أبها",
    "خميس مشيط",
    "بيشة",
    "النماص",
    "محايل عسير",
    "ظهران الجنوب",
    "تثليث",
    "رجال المع",
    "سراة عبيدة",
  ],
  "منطقة تبوك": ["تبوك", "الوجه", "تيماء", "ضباء", "أملج", "حقل"],
  "منطقة حائل": ["حائل", "بقعاء", "الغزالة", "الشنان", "السليمي", "الحائط"],
  "منطقة الحدود الشمالية": ["عرعر", "رفحاء", "طريف"],
  "منطقة جازان": ["جازان", "صامطة", "صبيا", "أبو عريش", "بيش", "الدرب"],
  "منطقة نجران": ["نجران", "شرورة", "حبونا", "بدر الجنوب"],
  "منطقة الباحة": ["الباحة", "بلجرشي", "المندق", "العقيق", "قلوة", "القرى"],
  "منطقة الجوف": ["سكاكا", "القريات", "دومة الجندل", "طبرجل"],
};

export type Applicant = {
  id: string;
  name: string;
  national_id: string;
  grade: string;
  birthdate: string;
  gender: "ذكر" | "أنثى";
  nationality: "سعودي" | "غير سعودي";
  region: keyof typeof regions;
  city: string;
  residence: string;
  phone: string;
  email?: string;
  guardian_name: string;
  guardian_relation: string;
  guardian_phone: string;
  entity_type: string;
  entity_name: string;
  notes?: string;

  created_by?: string;
  created_at: string;
};
